import { FileImageOutlined, InfoCircleOutlined, SearchOutlined } from '@ant-design/icons';
import { Carousel, Timeline } from 'antd';
import type { NextPage } from 'next'
import MainLayout from '../../layout/MainLayout';

const View2: NextPage = () => {
    return (
        <MainLayout>
            <Timeline style={{ 'maxWidth': '1100px', 'margin': '0 auto' }}>
                <img src="/svg/img2.jpg" style={{ 'width': '100%', 'height': '400px', 'objectFit': 'cover', 'marginBottom': '30px' }} alt="UI" />
                <Timeline.Item color="red" dot={<InfoCircleOutlined />}>
                    <h2>ԳՐԱՆԱԴԱՅԻ ՀԱՄԱԼՍԱՐԱՆ (ԻՍՊԱՆԻԱ)</h2>
                    <p>
                        Իսպանիայի Գրանադա քաղաքի համալսարանը (UGR)  հիմնադրվել է 1531 թվականին Կառլոս V կայսեր կողմից: Համալսարանն ունի շուրջ 80000 ուսանող և համարվում է Իսպանիայի չորրորդ ամենամեծ համալսարանը: Բացի Գրանադա քաղաքից, մասնաճյուղեր ունի նաև Հյուսիսային Աֆրիկայում (Սեուտա և Մելիլյա):
                    </p>
                    <p>
                        Ամեն տարի շուրջ 2000 եվրոպացի ուսանողներ Էրազմուս ծրագրի միջոցով ընդունվում են Գրանադային համալսարան: Համալսարանի Ժամանակակից լեզուների կենտրոն տարեկան ընդունվում են շուրջ 10000 միջազգային ուսանողներ: 2014 թվականին միջազգային ուսանողների քվերակության արդյունքում համալսարանը ճանաչվել է լավագույնը Իսպանիայում:
                    </p>
                </Timeline.Item>
                <Timeline.Item color="blue" dot={<FileImageOutlined />}>
                    <h3>ՏԵՍԱԴԱՐԱՆ</h3>
                    <Carousel autoplay>
                        <div>
                            <img src="/svg/p1.jpg" style={{ 'width': '100%', 'height': '400px', 'objectFit': 'contain' }} alt="UI" />
                        </div>
                        <div>
                            <img src="/svg/p2.jpg" style={{ 'width': '100%', 'height': '400px', 'objectFit': 'contain' }} alt="UI" />
                        </div>
                        {/* <div>
                            <img src="/svg/p3.jpg" style={{ 'width': '100%', 'height': '400px', 'objectFit': 'contain' }} alt="UI" />
                        </div> */}
                    </Carousel>
                </Timeline.Item>
                <Timeline.Item color="orange" dot={<SearchOutlined />}>
                    <h3>Ուսանողների շարժունություն.</h3>
                    <p>
                        Էրազմուս+ Միջազգային կրեդիտային շարժունության ծրագրի Գործողություն 107-ի շրջանակներում Գրանադայի համալսարանը տրամադրում է կրթաթոշակներ ՎՊՀ-ի ակադեմիական բոլոր աստիճանների ուսանողների, պրոֆեսորադասախոսական և վարչական անձնակազմի համար:
                    </p>
                    <p>
                        Ի՞նչ չափանիշներով է կատարվում ուսանողների ընտրությունը: Կրթաթաշակ ստանալու համար դիմող ուսանողների ընտրությունն իրականացվում է ըստ հետևյալ չափանիշների՝
                    </p>
                    <p>
                        1. Ուսման առաջադիմություն, <br />
                        2. Օտար լեզվի իմացություն (անգլերեն՝ B1-B2 կամ պորտուգալերեն)<br />
                        3. Մոտիվացիա,<br />
                        4. Ուսանողների արտալսարանային ակտիվությունը ցանկալի է:<br />
                    </p>
                    <p>
                        Ինչպե՞ս դիմել Գրանադայի համալսարանում Էրազմուսի կրթաթոշակ ստանալու համար: Դիմումները լրացվում են առցանց կարգով հետևյալ կայքէջում՝՝ <a href="https://oficinavirtual.ugr.es/apli/intercambio/alumnos_in/index.html">https://oficinavirtual.ugr.es/apli/intercambio/alumnos_in/index.html</a>: Պահանջվող փաստաթղթերն են՝
                    </p>
                    <p>
                        1. Լուսանկար,<br />
                        2. Անձը հաստատող փաստաթուղթ (անձնագիր/նույնականացման քարտ),<br />
                        3. Կրթական աստիճանը հաստատող փաստաթուղթ (մագիստրատուրայի և ասպիրանտուրայի ուսանողների համար),<br />
                        4. Ակադեմիական տեղեկագիր (բոլոր գնահատականներով՝ առաջին կուրսից սկսած),<br />
                        5. Մայր բուհում ուսանողի կարգավիճակը հաստատող տեղեկանք,<br />
                        6. Օտար լեզվի իմացության վկայական,<br />
                        7. Հրավեր-նամակ հյուրընկալող բուհի կողմից,<br />
                        8. Ուսումնական համաձայնագիր (հյուրընկալող բուհում ուսումնասիրելիք դասընթացների ցանկ)
                        Անհրաժեշտության/առկայության դեպքում՝<br />
                        9. Ֆիզիկական սահմանափակ կարողությունների կարգավիճակը հաստատող փաստաթուղթ,<br />
                        10. Սոցիալական անապահով կարգավիճակը հաստատող փաստաթուղթ,<br />
                        11. Հասարակական/քաղաքական անապահով կարգավիճակը հաստատող փաստաթուղթ,<br />
                        12. Այլ անհրաժեշտ փաստաթղթեր:<br />
                    </p>

                </Timeline.Item>
                <Timeline.Item color="blue"></Timeline.Item>
            </Timeline>
        </MainLayout>
    )
}

export default View2
