import { FileImageOutlined, InfoCircleOutlined, SearchOutlined } from '@ant-design/icons';
import { Carousel, Timeline } from 'antd';
import type { NextPage } from 'next'
import MainLayout from '../../layout/MainLayout';

const View3: NextPage = () => {
    return (
        <MainLayout>
            <Timeline style={{ 'maxWidth': '1100px', 'margin': '0 auto' }}>
                <img src="/svg/img3.png" style={{ 'width': '100%', 'height': '400px', 'objectFit': 'cover', 'marginBottom': '30px' }} alt="UI" />
                <Timeline.Item color="red" dot={<InfoCircleOutlined />}>
                    <h2>ՅԱՇԻ ԱԼԵՔՍԱՆԴՐՈՒ ԻՈԱՆ ԿՈՒԶԱ ՀԱՄԱԼՍԱՐԱՆ (ՌՈՒՄԻՆԻԱ)</h2>

                    <p>
                        Էրազմուս միջազգային կրեդիտային շարժունության ծրագրի շրջանակներում 2013 թվականից Վանաձորի պետական համալսարանը համագործակցում է Յաշի Ալեքսանդրու Իոան Կուզայի համալսարանի հետ (Ռումինիա): Յաշի համալսարանը հիմնադրվել է 1860 թ. արքայազն Ալեքսանդրու Իոան Կուզայի հրամանով և ներկայումս Ռումինիայի առաջատար համալսարաններից է։
                    </p>
                    <p>
                        Համալսարանն իրականացնում է կրթական ծրագրեր և դասընթացներ ռումիներենով, անգլերենով և ֆրանսերենով։ 2008թ. երրորդ տարին անընդմեջ Յաշի Ալեքսանդրու Իոան Կուզայի համալսարանը զբաղեցրել է առաջին տեղը միջազգային հետազոտության ոլորտում՝ Շանհայի չափանիշներով։
                    </p>
                </Timeline.Item>
                <Timeline.Item color="blue" dot={<FileImageOutlined />}>
                    <h3>ՏԵՍԱԴԱՐԱՆ</h3>
                    <Carousel autoplay>
                        <div>
                            <img src="/svg/p1.jpg" style={{ 'width': '100%', 'height': '400px', 'objectFit': 'contain' }} alt="UI" />
                        </div>
                        <div>
                            <img src="/svg/p2.jpg" style={{ 'width': '100%', 'height': '400px', 'objectFit': 'contain' }} alt="UI" />
                        </div>
                        {/* <div>
                            <img src="/svg/p3.jpg" style={{ 'width': '100%', 'height': '400px', 'objectFit': 'contain' }} alt="UI" />
                        </div> */}
                    </Carousel>
                </Timeline.Item>
                <Timeline.Item color="orange" dot={<SearchOutlined />}>
                    <p>
                        Միջազգային կրեդիտային շարժունության ծրագրի շրջանակներում ՎՊՀ-ից 16 ուսանողներ արդեն ուսումնառություն են ստացել Յաշի համալսարանում, իսկ ռումինացի մեկ ուսանող շարժունությամբ ուսումնառել է ՎՊՀ-ում։
                    </p>

                    <p>
                        «Յաշիի համալսարանում շարժունության փորձառությունը կյանքում մեկ անգամ տրվող հնարավորություն էր՝ համատեղելու որակյալ կրթությունը կյանքի մարտահրավերների հետ և դառնալու ավելի ինքնավստահ և մոտիվացված»,- նշում է Էրիկ Դալլաքյանը, ով Էրազմուս+ ծրագրի շրջանակներում 2017թ. մեկ կիսամյակ տևողությամբ ուսումնառություն է ստացել Յաշի Ալեքսանդրու Իոան Կուզայի համալսարանում։
                    </p>

                    <h3>ՅԱՇԻ ՀԱՄԱԼՍԱՐԱՆՈՒՄ ՇԱՐԺՈՒՆՈՒԹՅԱՆ ՊԱՅՄԱՆՆԵՐԸ</h3>

                    <p>
                        Էրազմուս+ Միջազգային կրեդիտային շարժունության ծրագրի Գործողություն 107-ի շրջանակներում Յաշի Ալեքսանդրու Իոան Կուզայի համալսարանը տրամադրում է կրթաթոշակներ ՎՊՀ-ի ակադեմիական բոլոր աստիճանների ուսանողների, պրոֆեսորադասախոսական և վարչական անձնակազմի համար:
                        Ուսանողների շարժունություն. Էրզմուս ծրագրի շրջանակներում Յաշի Ալեքսանդրու Իոան Կուզայի համալսարանը տրամադրում է ուսանողական շարժունության կրթաթոշակներ մեկ կիսամյակ տևողությամբ:
                    </p>

                    <p>
                        Ովքե՞ր կարող են դիմել Էրազմուսի կրթաթոշակ ստանալու համար: Ուսանողական շարժունության կրթաթոշակի համար կարող են դիմել բակալավրի 2-րդ, 3-րդ և 4րդ (առաջին կիսամյակ) կուրսի, մագիստրատուրայի 1-ին և 2-րդ կուրսի (առաջին կիսամյակ) և ասպիրանտուրայի ուսանողները:
                        Ի՞նչ դասընթացներ կարելի է անցնել ուսումնառության ընթացքում: Համալսարանը տրամադրում է բազմակողմանի կրթություն տարբեր բաժիններում՝ անգլերենով և ֆրանսերենով: Յաշի Ալեքսանդրու Իոան Կուզայի համալսարանում Էրազմուս+ ծրագրով իրականացվող գործողություններին կարելի է ծանոթանալ հետևյալ հղումով՝ <a href="http://www.uaic.ro/en/international/erasmus-programme/students"> http://www.uaic.ro/en/international/erasmus-programme/students </a>
                        Ի՞նչ չափանիշներով է կատարվում ուսանողների ընտրությունը: Կրթաթաշակ ստանալու համար դիմող ուսանողների ընտրությունն իրականացվում է ըստ հետևյալ չափանիշների՝

                    </p>
                    <p>
                        1. Ուսման առաջադիմություն, <br />
                        2. Օտար լեզվի իմացություն (անգլերեն՝ B1-B2 կամ պորտուգալերեն)<br />
                        3. Մոտիվացիա,<br />
                        4. Ուսանողների արտալսարանային ակտիվությունը ցանկալի է:<br />
                    </p>
                    <p>
                        Ինչպե՞ս դիմել Յաշի Ալեքսանդրու Իոան Կուզայի համալսարանում Էրազմուսի կրթաթոշակ ստանալու համար: Դիմումները լրացվում են առցանց կարգով համալսարանի կայքէջում:
                    </p>
                    <p>
                        1. Լուսանկար,<br />
                        2. Անձը հաստատող փաստաթուղթ (անձնագիր/նույնականացման քարտ),<br />
                        3. Կրթական աստիճանը հաստատող փաստաթուղթ (մագիստրատուրայի և ասպիրանտուրայի ուսանողների համար),<br />
                        4. Ակադեմիական տեղեկագիր (բոլոր գնահատականներով՝ առաջին կուրսից սկսած),<br />
                        5. Մայր բուհում ուսանողի կարգավիճակը հաստատող տեղեկանք,<br />
                        6. Օտար լեզվի իմացության վկայական,<br />
                        7. Հրավեր-նամակ հյուրընկալող բուհի կողմից,<br />
                        8. Ուսումնական համաձայնագիր (հյուրընկալող բուհում ուսումնասիրելիք դասընթացների ցանկ)
                        Անհրաժեշտության/առկայության դեպքում՝<br />
                        9. Ֆիզիկական սահմանափակ կարողությունների կարգավիճակը հաստատող փաստաթուղթ,<br />
                        10. Սոցիալական անապահով կարգավիճակը հաստատող փաստաթուղթ,<br />
                        11. Հասարակական/քաղաքական անապահով կարգավիճակը հաստատող փաստաթուղթ,<br />
                        12. Այլ անհրաժեշտ փաստաթղթեր:<br />
                    </p>

                </Timeline.Item>
                <Timeline.Item color="blue"></Timeline.Item>
            </Timeline>
        </MainLayout>
    )
}

export default View3
