import type { NextPage } from 'next'
import MainLayout from '../layout/MainLayout';
import { Collapse, Tabs } from 'antd';
import { QuestionCircleOutlined } from '@ant-design/icons';

const Questions: NextPage = () => {

    const { Panel } = Collapse;

    const collapses: any = [
        {
            id: 1,
            header: 'Որո՞նք են ՀՀ-ում օտարերկրյա որակավորումների ճանաչումն իրականացնող մարմինները:',
            text: 'Օտարերկրյա որակավորումների ճանաչումն իրականացվում է տարբեր մարմինների կողմից` ակադեմիական կամ մասնագիտական գործունեություն ծավալելու համար` Ակադեմիական փոխճանաչման և շարժունության ազգային տեղեկատվական կենտրոնի (ԱՓՇԱՏԿ), բարձրագույն ուսումնական հաստատությունների և մասնագիտական մարմինների կողմից, որոնք պատասխանատու են տվյալ ոլորտի համար:'
        }
        , {
            id: 2,
            header: 'Ինչպիսի՞ տեղեկանքներ է տրամադրում Ակադեմիական փոխճանաչման և շարժունության ազգային տեղեկատվական կենտրոնը:',
            text: 'ԱՓՇԱՏԿ-ը տրամադրում է որակավորումների ճանաչման, խորհրդատվական և այլ տիպի տեղեկանքներ: Ճանաչման և խորհրդատվական տեղեկանքներն ունեն միասնական ձևաչափ, որի մեջ ներառվում է բուհի հավատագրման, կրթական ծրագրի որակի, տևողության և կրթության ձևի, կրեդիտների քանակի, որակավորման մակարդակի և դրա ակադեմիական և մասնագիտական իրավունքների վերաբերյալ տեղեկատվություն: Այլ տիպի տեղեկանքները մեծամասամբ վերաբերվում են գնահատման և կրեդիտային համակարգերին, կրթական ծրագրերին, որակավորումների ազգային շրջանակներին և այլն:'
        },
        , {
            id: 2,
            header: 'Որո՞նք են ՀՀ-ում օտարերկրյա որակավորումների ճանաչումն իրականացնող մարմինները:',
            text: 'Օտարերկրյա որակավորումների ճանաչումն իրականացվում է տարբեր մարմինների կողմից` ակադեմիական կամ մասնագիտական գործունեություն ծավալելու համար` Ակադեմիական փոխճանաչման և շարժունության ազգային տեղեկատվական կենտրոնի (ԱՓՇԱՏԿ), բարձրագույն ուսումնական հաստատությունների և մասնագիտական մարմինների կողմից, որոնք պատասխանատու են տվյալ ոլորտի համար:'
        }
    ];
    const collapses2: any = [
        {
            id: 1,
            header: 'Ի՞նչ փաստաթղթեր են անհրաժեշտ որակավորումների ճանաչման համար:',
            text: 'Կրթական փաստաթղթի գնահատման համար անհրաժեշտ է ներկայացնել  Անձնագրի կամ նույնականացման քարտի պատճեն: Կրթությունը հաստատող փաստաթուղթ(բնօրինակ և/ կամ նոտարի կողմից վավերացված թարգմանություն): Կրթությունը հաստատող փաստաթղթի ներդիր, հավելված կամ այլ նմանատիպ փաստաթուղթ, որոնցում նշված են կրթական ծրագրի մանրամասները` ուսումնական վերջնարդյունքներ, կրեդիտներ, գնահատականներ, ավարտական պահանջներ և այլն (բնօրինակ և/կամ նոտարի կողմից վավերացված թարգմանություն): Այլ տիպի ապացույցներ, այդ թվում` նախորդ կրթությունը հավաստող փաստաթղթեր, մասնագիտական գործունեություն ծավալելու թույլտվություն, աշխատանքային փորձը հաստատող փաստաթղթեր: Վճարման անդորրագիր: '
        }
        , {
            id: 2,
            header: 'Որո՞նք են այն իրավական փաստաթղթերը, որոնց հիման վրա իրականացվում է օտարերկրյա որակավորումների /դիպլոմների, սերտիֆիկատների, վկայականների/ ճանաչումը ՀՀ-ում:',
            text: 'ՀՀ-ում օտարերկրյա կրթական փաստաթղթերի ճանաչման գործընթացն իրականացվում է Լիսաբոնի ճանաչման կոնվենցիայի, առանձին երկրների հետ գոյություն ունեցող միջպետական և փոխճանաչման համաձայնագրերի հիման վրա, ինչպես նաև ազգային կրթական օրենսդրության համաձայն:'
        },
        , {
            id: 2,
            header: 'Ի՞նչ փաստաթղթեր են անհրաժեշտ որակավորումների ճանաչման համար:',
            text: `անձնագրի կամ անձը հաստատող այլ փաստաթղթի պատճեն, կրթությունը հաստատող փաստաթուղթ (բնօրինակ և/կամ նոտարի կողմից վավերացված թարգմանություն), կրթությունը հաստատող փաստաթղթի ներդիր, հավելված կամ այլ նմանատիպ փաստաթուղթ, որում նշված են կրթական ծրագրի մանրամասները ուսումնական վերջնարդյունքներ, կրեդիտներ, գնահատականներ, ավարտական պահանջներ և այլն(բնօրինակ և/ կամ նոտարի կողմից վավերացված թարգմանություն), այլ տիպի ապացույցներ, այդ թվում  նախորդ կրթությունը հավաստող փաստաթղթեր, մասնագիտական գործունեություն ծավալելու թույլտվություն, աշխատանքային փորձը հաստատող փաստաթղթեր, վճարման անդորրագիր: `
        }
    ];
    const collapses3: any = [
        {
            id: 1,
            header: 'Ի՞նչ է հարատև կրթությունը:',
            text: 'Հարատև կրթությունը անձի՝ ամբողջ կյանքի ընթացքում ձեռք բերած ուսուցման գործընթացն է՝ ֆորմալ, ոչ ֆորմալ և ինֆորմալ կրթության միջոցով, որի արդյունքում անհատը ձևավորում կամ կատարելագործում է իր գիտելիքները, կարողությունները և հմտությունները, ինչպես նաև արժեհամակարգը: '
        }
        , {
            id: 2,
            header: 'Ի՞նչ է ոչ ֆորմալ կրթությունը:',
            text: 'Ոչ ֆորմալ կրթությունը (ուսուցումը) լրացուցիչ ուսուցման ծրագիր կամ ծրագրերի ամբողջություն է, որն իրականացվում է համապատասխան ուսումնական հաստատության (հաստատությունների) կամ այդ գործառույթն իրականացնելու իրավասություն ունեցող կազմակերպության և (կամ) ծառայության միջոցով, սակայն չի հանգեցնում որակավորման աստիճանի շնորհման և ուսուցման արդյունքների պաշտոնական ճանաչման, բացառությամբ Հայաստանի Հանրապետության օրենքներով սահմանված դեպքերի:'
        },
        , {
            id: 2,
            header: 'Ի՞նչ է ինֆորմալ կրթությունը:',
            text: `Ինֆորմալ կրթությունը անձի՝ առօրյա և ընտանեկան կյանքի, հանգստի, ժամանցի, աշխատանքային գործունեության և այլ տարբեր գործողությունների արդյունքում ձեռք բերված ուսուցումն է, որի արդյունքները, որպես կանոն, կանխամտածված չեն անձի կողմից որպես նպատակային ուսումնառություն, կազմակերպված և համակարգված չեն ժամանակի կամ ռեսուրսների առումով, չեն հանգեցնում արդյունքների պաշտոնական ճանաչման, բացառությամբ Հայաստանի Հանրապետության օրենսդրությամբ սահմանված դեպքերի:`
        }
    ];

    return (
        <MainLayout>
            <Tabs
                tabPosition='left'
                defaultActiveKey="1"
                items={[
                    {
                        label: (<span>
                            <QuestionCircleOutlined />
                            Կարևոր
                        </span>),
                        key: '1',
                        children: <Collapse
                            ghost
                        >
                            {collapses.map((el: any, index: any) => {
                                return (
                                    <Panel header={el.header} key={index} className="site-collapse-custom-panel">
                                        <p>{el.text}</p>
                                    </Panel>
                                )
                            })}
                        </Collapse>,
                    },
                    {
                        label: (<span>
                            <QuestionCircleOutlined />
                            Հետաքրքիր
                        </span>),
                        key: '2',
                        children: <Collapse
                            ghost
                        >
                            {collapses2.map((el: any, index: any) => {
                                return (
                                    <Panel header={el.header} key={index} className="site-collapse-custom-panel">
                                        <p>{el.text}</p>
                                    </Panel>
                                )
                            })}
                        </Collapse>,
                    },
                    {
                        label: (<span>
                            <QuestionCircleOutlined />
                            Կրթությունը
                        </span>),
                        key: '3',
                        children: <Collapse
                            ghost
                        >
                            {collapses3.map((el: any, index: any) => {
                                return (
                                    <Panel header={el.header} key={index} className="site-collapse-custom-panel">
                                        <p>{el.text}</p>
                                    </Panel>
                                )
                            })}
                        </Collapse>,
                    }
                ]}
            />
        </MainLayout>
    )
}

export default Questions
