import { BookOutlined, BookTwoTone, SmileOutlined, SoundTwoTone, TrophyTwoTone, UserOutlined } from '@ant-design/icons';
import { Avatar, Card, Carousel, Timeline } from 'antd';
import Meta from 'antd/lib/card/Meta';
import type { NextPage } from 'next'
import { useRouter } from 'next/router';
import { useEffect, useState } from 'react';
import MainLayout from '../../layout/MainLayout';

const View: NextPage = () => {

    const [select, setSelect] = useState<any>('')
    const router = useRouter();

    const cards = [
        {
            id: 1,
            header: "Աիդա Կիրակոսյան",
            desc: "Օքսֆորդի համալսարան",
            text: <>Ծնվել եմ 1986 թվին Իրանի մայրաքաղաք Թեհրանում: Թեև Հայաստանից հեռու, բայց ծնողներիս շնորհիվ հայկական մշակույթը, գրականությունը, երաժշտությունը և պարը ներկա էին իմ առօրյա կյանքում: Փոքր հասակից անչափ հետաքրքրված էի արվեստով: Մանկության տարիներին ննջարանիս պատերն ամբողջովին նկարազարդել էի: Ծնողներս, նկատելով իմ ձգտումը դեպի նկարչություն և գրականություն, ինձ քաջալերում էին կարդալ Հովհաննես Թումանյանի ստեղծագործությունները և ուսումնասիրել Հովհաննես Այվազովսկու կտավները: Նրանք ինձ նաև ուղարկեցին հայկական պարի դասերի և օգնեցին կազմակերպել նկարներիս առաջին ցուցահանդեսը:
                <br /><br />
                Մանկությունս անցավ Իրանում, որտեղ հաճախեցի հայկական դպրոց և ձեռք բերեցի թե՛ Պարսկական և թե՛ Հայկական դիպլոմ: 2004 թվին ընդունվեցի Իրանի ամենահեղինակավոր համալսարաններից մեկը` համակարգչային գիտության և ճարտարագիտության բաժին: Միևնույն ժամանակ շարունակում էի նկարել: Ի վերջո, 2007 թվականին Թեհրանից տեղափոխվեցի Լոս Անջելես, որպեսզի շարունակեմ ուսումս Կալիֆորնիայի պետական համալսարանում (Նորթրիջ): Այդ տարիներին մասնակցեցի զանազան ցուցահանդեսների և ստացա պատվավոր նշան: 2011 թվականին արժանացա նկարչության Hans Burkhardt կրթաթոշակին: Համալսարանն ավարտելուց հետո ժամանակս նվիրել եմ երեխաներին և նրանց կրթությանը: Աշխատում եմ դպրոցում և ծանոթանում երեխաների հոգեբանությանը: Նրանց կրթելը և օգնելն իմ ամենաարժեքավոր աշխատանքն է եղել:
                <br /><br />
                Շատ տարիներ են անցել այն օրերից, երբ ննջարանիս պատերին էի նկարում, բայց արվեստը շարունակում է ուղղություն տալ իմ կյանքին: Համալսարանը ավարտելուց հետո նույնպես մասնակցել եմ տարբեր ցուցահանդեսների և աշխատել` որպես անկախ նկարիչ ու լուսանկարիչ: Ուսումս շարունակելու համար ընդունվել եմ Օքսֆորդի համալսարանի Ռասկին արվեստի դպրոցի մագիստրատուրա, որ մեկնարկելու է 2017 թվականի աշնանը:</>,
            avatar: '/svg/1.jpg',
            start: 2017
        },
        {
            id: 2,
            header: "Ահարոն Լևոնյան",
            desc: " Կոլումբիայի համալսարան",
            text: <>Ծնվել եմ 1977 թվականին Երևան քաղաքում:
                <br /><br />
                1994-1999 թթ. ուսանել եմ Երևանի ժողովրդական տնտեսության ինստիտուտի ընդհանուր տնտեսագիտության ֆակուլտետում` ստանալով տնտեսագետի որակավորում գերազանցության դիպլոմով:
                <br /><br />
                1999-2002 թթ. ուսումս շարունակել եմ ՀՀ գիտությունների ազգային ակադեմիայում` ստանալով տնտեսագիտության թեկնածուի գիտական աստիճան:
                <br /><br />
                2008-2010 թթ. մասնակցել եմ ԱՄՆ Փենսիլվանիայի համալսարանի ABA Stonier ազգային բանկային դպրոցի դասընթացներին` ստանալով ավարտական վկայական:
                <br /><br />
                2012 թվականին ընդունվել եմ Կոլումբիայի համալսարանի բիզնես դպրոցի և Լոնդոնի բիզնես դպրոցի համատեղ կազմակերպած Global EMBA ծրագիր, որը կավարտեմ 2014 թվականին:
                <br /><br />
                Աշխատանքային գործունեությունս սկսել եմ 1998 թվականին`«Էյչ-Էս-Բի-Սի Բանկ Հայաստանշ ընկերության ֆինանսական վերահսկողության վարչությունում: Տարիների ընթացքում ֆինանսական համակարգում զբաղեցրել եմ տարբեր պաշտոններ, այդ թվում` նաև ղեկավար:
                <br /><br />
                2004-2010 թվականին աշխատել եմ «Կասկադ Կապիտալ Հոլդինգսի» անդամ-ընկերություններում` զբաղեցնելով ղեկավար պաշտոններ: 2008-2010 թվականներին եղել եմ «Կասկադ Բանկ» ՓԲԸ գլխավոր տնօրեն:
                <br /><br />
                2011 թվականից զբաղեցնում եմ «Սթորք Ինվեսթմենթ Հոլդինգ» ընկերության գլխավոր ֆինանսական տնօրենի պաշտոնը:
                <br /><br />
                Ազատ տիրապետում եմ հայերեն, ռուսերեն և անգլերեն լեզուներին: Ամուսնացած եմ, ունեմ երկու տղա:</>,
            avatar: '/svg/2.jpg',
            start: 2012
        },
        {
            id: 3,
            header: "Անահիտ Հայրապետյան",
            desc: "Կոլումբիայի համալսարան",
            text: <>Ծնվել եմ 1987 թ. Երևանում` Հայաստանում: 2003 թ. սկսել եմ սովորել ճարտարապետություն Երևանի պետական ճարտարապետության և շինարարության համալսարանում: Այս տարիների ընթացքում մի շարք պրակտիկաներ եմ անցել Երևանում և Մոսկվայում, մասնակցել եմ մի շարք մրցույթների և աշխատաժողովների ինչպես անհատապես, այնպես էլ թիմի կազմում: Բազմաթիվ մրցանակներ եմ ստացել իմ աշխատանքի համար և միաժամանակ պահպանել բարձր ՄՈԳ-ը:
                <br /><br />
                ԵրՃՇՊՀ-ն ավարտելուց և Հայաստանում երկու տարի պրոֆեսիոնալ մակարդակով աշխատելուց հետո որոշեցի կրթությունս շարունակել Գերմանիայում: 2011-2013 թթ. ձեռք բերեցի ճարտարապետի մագիստրոսի աստիճան Դեսսաու ճարտարապետության միջազգային դպրոցում:
                <br /><br />
                Չինաստանում փորձ ձեռք բերելու նկատմամբ իմ հետաքրքրությունը մեծացավ այն բանից հետո, երբ մագիստրոսի աստիճան ստացա, իսկ հետո ցանկացա ընդլայնել իմ հեռանկարները և ավելի լավ հասկանալ չինական քաղաքների արագացված ուրբանիզացումը: Մտքումս ունենալով այս նպատակը՝ տեղափոխվեցի Պեկին՝ Չինաստան, և աշխատեցի այնտեղ որպես ճարտարապետ մինչև 2015 թ. գարուն: Չինաստանում անցկացրած ժամանակ միջազգային թիմի հետ աշխատել եմ տարբեր տեսակի և տարբեր մասշտաբների նախագծերի վրա:
                <br /><br />
                Վերջերս ընդունվել եմ Կոլումբիայի համալսարանի առաջադեմ ճարտարապետական դիզայնի մագիստրատուրայի գիտական բաժին: Ես շատ ուրախ եմ սովորել առաջադեմ և փորձարարական միջավայրում, որը կարող է ապահովել ինձ դինամիկ և միջդիսցիպլինար մտածողությամբ, որն էլ, ըստ իս, կզարգացնի պրոֆեսիոնալ ճարտարապետի իմ կարողությունները:</>,
            avatar: '/svg/3.jpg',
            start: 2015
        },
        {
            id: 4,
            header: "Անդրեյ Սիմոնյան",
            desc: "Չիկագոյի Համալսարան",
            text: <>Ես ծնվել եմ 1988 թ. սեպտեմբերի 27-ին Լեռնային Ղարաբաղի Ստեփանակերտ քաղաքում: Իմ ծնվելուց կարճ ժամանակ անց իմ ընտանիքը տեղափոխվել է Ռուսաստանի Կրասնոդար քաղաք, իսկ այնուհետ վերջնականապես բնակություն է հաստատել Մոսկվայում: Ես մեծացել եմ որպես բազմակողմանի հետաքրքրություններ ունցող երեխա՝ սկսած երաժշտությունից մինչև սպորտ. եղել եմ ֆուտբոլի և վոլեյբոլի հիմնական թիմի կազմում, հաճախել դաշնամուրի դասերի՝ բարձր առաջադիմությամբ ավարտելով տեղի երաժշտական դպրոցը:
                <br /><br />
                2005 թ. ընդունվեցի Ռուսաստանի ժողովուրդների բարեկամության համալսարան՝ մասնագիտանալով օրենքի և անգլերենի բնագավառում, և ուսման վերջին տարիներին միացա միջազգային իրավաբանական ընկերության մոսկովյան գրասենյակին: Ընկերությունում աշխատելուց երկու տարի անց ընդունվեցի Քորնելի իրավաբանական դպրոց՝ իրավաբանի մագիստրոսական ծրագրով սովորելու, իսկ ավելի ուշ լիցենզավորման քննություն հանձնեցի Նյու Յորք նահանգում իրավաբանությամբ զբաղվելու համար:
                <br /><br />
                Վերադառնալով իմ իրավաբանական ընկերություն՝ շարունակեցի իրավաբանական կարիերան կարճ ժամանակահատվածով, բայց աստիճանաբար հասկացա իմ աճող կիրքը բիզնեսի բնագավառի նկատմամբ: Արդյունքում ես որոշեցի ի մի բերել կարողություններս և ստանալ բիզնեսի կառավարման մագիստրոսի աստիճան ֆինանսների ոլորտում կարիերա սկսելու համար: 2016 թ. վերջին ես սկսեցի սովորել Չիկագոյի Համալսարանի Բյուսի անվան բիզնես դպրոցում։</>,
            avatar: '/svg/4.jpg',
            start: 2016

        },
        {
            id: 5,
            header: "Աննա Հակոբյան",
            desc: "Լոնդոնի համալսարան",
            avatar: '/svg/5.jpg',
            text: <>Ստացել եմ իրավաբանական մագիստրոսի կրթության առաջարկ Սթենֆորդի համալսարանի Իրավաբանական ֆակուլտետի Միջազգային և համեմատական իրավական գիտությունների սթենֆորդյան ծրագրից (SPILS): Վերջինիս շրջանակներում էմպիրիկ գիտական հետազոտություն եմ իրականացնելու մրցակցային իրավունքի և անհատական տվյալների պաշտպանության ոլորտներում, որը կենտրոնանալու է Մեծ Տվյալների (Big Data) տիրապետող ընկերությունների վրա և ենթադրելու է գնահատման չափանիշների վերլուծություն` ԱՄՆ և ԵՄ մրցակցային գործերի շրջանակներում:
                <br /><br />
                Ծնվել եմ 1982 թ.-ին Հայաստանում և մեծացել ու ականատեսն եմ եղել երկրի անցմանը սոցիալիստական պետությունից դեպի շուկայական տնտեսություն ունեցող պետության: Մասնագիտական ջանքերս ուղղված են եղել` աջակցելու Հայաստանին այս դժվարին ուղին անցնելիս:
                <br /><br />
                Իմ մասնագիտական վերջին փորձը փաստաբանական գործունեությունն է Քեյ ընդ Փի իրավաբանական գրասենյակում, որը համատեղում եմ Երևանի Պետական Համալսարանի իրավագիտության ֆակուլտետում, ինչպես նաև Եվրոպական ուսումնասիրությունների կենտրոնում դասավանդման ու հետազոտական աշխատանքների հետ: Եղել եմ Բաց հասարակության ինստիտուտի (ԲՀԻ) հետազոտող, ինչպես նաև մասնակցել եմ ԲՀԻ հետազոտական և դասավանդման մի շարք ծրագրերի: Մասնագիտական գործունեությունս սկսել եմ իրավական քաղաքականության ոլորտում Հայաստանում գործող մի շարք Եվրոպական և Ամերիկյան ծրագրերում, որոնցից էին Ամերիկյան իրավաբանների ընկերակցությունը, ԵԱՀԿ հայաստանյան ընտրությունների դիտորդական առաքելությունը և այլն:
                <br /><br />
                Ստացել եմ իրավաբանական մագիստրոսի աստիճան Լոնդոնի համալսարանից (University College London), Երևանի պետական համալսարանի իրավագիտության ֆակուլտետի բակալավրի և մագիստրոսի կոչումներ: Ունեմ Հայաստանի փաստաբանի որակավորում:</>,
            start: 2018
        },
        {
            id: 6,
            header: "Աննա Մելոյան",
            desc: "Եյլի համալսարան",
            text: <>Ես ծնվել և մեծացել եմ Երևանում. մի քաղաք, որն ինձ պարգևել է կյանքի ամենաշքեղ նախաբանը: Առաջինից չորրորդ դասարան հաճախել եմ Երևանի Նիկոլ Աղբալյանի անվան թիվ 19 միջնակարգ դպրոց: Երևան քաղաքը թանգարան է բաց երկնքի տակ, որտեղ ես ամեն օր զբոսնում էի ու հասկանում անհատականության, զգացմունքների և պատմության խորությունը, որն առաջին հայացքից պարզ վարդագույն տուֆից շինությունները կարող են արտահայտել: Ես շրջապատված էի երեք հազարամյակի ճարտարապետական և մշակութային պատմության շեն կանգնած վկաներով, ու աշխարհայացքիս ձևավորման վրա մեծ ազդեցություն ունեցավ այս միջավայրը. այն ինձ հայրենասիրական հպարտւթյուն ներշնչեց, որը մինչ օրս տածում եմ:
                <br /><br />
                Տասը տարեկան հասակում Կալիֆորնիա տեղափոխությունն ինձ ծանոթացրեց հնարավորւթյունների երկրին, որն իմ մեջ ձևավորեց լավատեսություն, իմ հնարավոորությունների հանդեպ վստահություն և իմ ձգտումներին հասնելու վճռականություն: 2007 թ.` դպրոցն ավարտելուց հետո, չորս տարի հաճախեցի Գլենդելի և Փասադենայի քոլեջներ: Ինձ բախտ վիճակվեց հաճախել կրթօջախներ և հանդիպել դասախոսների, ում կողմից ինձ շնորհված բազմեզր մտածելակերպը և մտքի ազատությունը հագեցրին ուսման տարբեր բնագավառների հանդեպ իմ հետաքրքրասիրությանը: Ուսման ընթացքում ճարտարապետության հանդեպ իմ սերն էլ ավելի սրվեց և 2011 թ. այն ինձ բերերց UCLA-ի ճարտարապետության և քաղաքաշինության ֆակուլտետ, որտեղ ես հնարավորություն ունեցա ավելի սերտորեն ուսումնասիրել այս մասնագիտությունը:
                <br /><br />
                Ես հպարտ եմ, որ հայ ժողովրդին բնորոշ դիմացկունությունը, վճռականությունը, հաստատակամությունը, ընտանեկան արժեքները և մշակութային ինքնությունը Ամերիկայի ոգեշնչման և քաջալերման հետ համատեղ թույլ տվեցին, որ ձգտեմ իմ նպատակների իրականացմանը: Ուրախ եմ, որ ինձ հնարավորություն ընձեռվեց ուսումս շարունակելու Եյլի համալսարանում և բացահայտել ինձ սպասվող նոր փորձություններ ու հնարավորություններ:</>,
            avatar: '/svg/6.jpg',
            start: 2011
        },
        {
            id: 7,
            header: "Արա Խաչատրյան",
            desc: "Կոլումբիայի համալսարան",
            text: <>Ծնվել եմ 1989 թվականին Երևան քաղաքում: Ինձ բախտ է վիճակվել մեծանալ մի ընտանիքում, որտեղ կրթությունն ու ինքնազարգացումը գնահատվել են ամեն ինչից առավել: Լինելով ընտանիքի երեք երեխաներից ավագը՝ միշտ փորձել եմ լինել լավագույնն ամեն ինչում և պատասխանատվություն եմ զգացել` լինելու ընդօրինակման առարկա իմ կրտսեր քրոջ և եղբոր համար:
                <br /><br />
                Հինգ տարեկանից հաճախել եմ շախմատի դպրոց: 13 տարեկանում ստացել եմ առաջին կարգ շախմատում, բայց հետագայում թողել եմ պրոֆեսիոնալ շախմատը, որպեսզի իմ մրցակցային ներուժն ուղղեմ ֆինանսների բնագավառում գերազանց մասնագետ դառնալուն: Ինձ մոտիվացնող կարևորագույն գործոնը հայկական տնտեսության զարգացման գործում իմ ներդրումն ունենալն է եղել:
                <br /><br />
                2005թ. ավարտելով մասնավոր ավագ դպրոցը՝ շարունակել եմ ուսումս՝ ձեռք բերելով տնտեսագիտության բակալավրի և մագիստրոսի կոչումներ Երևանի Պետական Համալսարանում, կիրառական հաշվապահության բակալավրի աստիճան Օքսֆորդ Բրուքս համալսարանում և ACCA (Երդվյալ որակավորված հաշվապահների անդամակցություն) անդամագրություն: Մինչև 2015 թ.-ն իմ ստացած մոտ 10 տարվա բարձրագույն կրթությունն աջակցել է ինձ իմ ողջ մասնագիտական կարիերայի ընթացքում:
                <br /><br />
                Կառուցել եմ նշանակալի կարիերա՝ աշխատելով խորհրդատվության և աուդիտի բնագավառում ավելի քան 8 տարի: PWC-ում անցկացրած 3 տարիների ընթացքում ունեցել եմ հնարավորություն` աշխատելու մի շարք հետսովետական երկրներում, ինչի շնորհիվ կարողացել եմ գնահատել այդ երկրների զարգացման տենդենցների տարբերությունները, համեմատել դրանք Հայաստանի հետ և ձեռք բերել արժեքավոր փորձ: Սկսել եմ աշխատել Galaxy Concern–ում` որպես ընկերություններից մեկի ֆինանսական տնօրեն, իսկ 2016թ-ին նշանակվել եմ ողջ կազմակերպության ֆինանասկան տնօրեն: Ներկայումս ղեկավարում եմ միջազգային թիմ և համակարգում կազմակերպության ներքո տարբեր ընկերությունների ֆինանսական ֆունկցիաները:
                <br /><br />
                Բացի իմ հիմնական աշխատանքից` որպես ֆինանսական տնօրեն՝ ես նաև դասախոսություններ եմ կարդում Հայաստանի ամերիկյան համալսարանում: Սա ավելի շատ հոբբի է, քան աշխատանք: Դասախոսությունն ինձ համար աշխատանքային օրվանից հետո ուժեր հավաքելու հրաշալի միջոց է: Իմ ուսանողների ոգևորությունն իրենց ձեռք բերած գիտելիքներից մեծ մոտիվացիոն գործոն է ինձ համար:</>,
            avatar: '/svg/7.jpg',
            start: 2012
        },
        {
            id: 8,
            header: "Աննա Սրապիոնյան",
            desc: "Չիկագոյի համալսարան",
            text: <>
                Երբ ընդամենը 5 տարեկան էի, ունեի երազանք և վստահ էի, որ մի օր այն իրականություն կդառնա: Ոչ ոք չգիտեր այդ մասին, քանի դեռ մի օր ծնողներս չհարցրին. «Աննա, ի՞նչ ես ուզում դառնալ ապագայում»: Եվ ես պատասխանեցի. «Մամ…պապ…ուզում եմ դառնալ ակադեմիկոս»: Նրանք մտածեցին, որ ես չեմ հասկանում՝ ինչ է դա նշանակում: Այդ պահից սկսած ամեն ինչ անում եմ իմ նպատակն իրականություն դարձնելու համար: Եվ ես վստահ եմ, որ կարող եմ դառնալ հայտնի գիտնական ու սեփական ներդրումն ունենալ իմ ոլորտում: Կարծում եմ՝ արդեն իսկ ճիշտ ուղու վրա եմ….
                <br /><br />
                Առաջին քայլերս արել եմ Երևանի պետական համալսարանին առընթեր Ա. Շահինյաի անվան հատուկ Ֆիզմաթ դպրոցում: 6-րդ դասարանում ընդունվելով Ֆիզմաթ՝ մասնակցել եմ տարբեր մարզային, հանրապետական ու միջազգային օլիմպիադաների: 2009 թ. ստացել եմ ՀՀ նախագահական առաջին կարգի պարգև ՏՏ ոլորտում «Լավագույն աշակերտ» անվանակարգում և ոսկե մեդալ` դպրոցում սովորելու տարիներին գերազանց առաջադիմություն ցուցաբերելու համար:
                <br /><br />
                2009-2013 թվականներին սովորել եմ ԵՊՀ մաթեմատիկայի և մեխանիկայի ֆակուլտետում: Բնույթով հետաքրքրասեր լինելով՝ սիրում եմ հետազոտություններ անել և նոր բաներ հայտնագործել: Մաթեմատիկան յուրահատուկ աշխարհ է ինձ համար, և այն հետազոտելն ուղղակի հաճույք է: Արկածներս սկսվեցին, երբ բարձրագույն հանրահաշվի և թվերի տեսության դասախոսս առաջարկեց իրեն օգնել «Գծային տարածություններ և գծային արտապատկերումներ» գիրքը գրելիս, որն իսկական մարտահրավեր էր 2-րդ կուրսի ուսանողուհու համար: 2012 թ. հունիս ամսին մասնակցել եմ Հայկական մաթեմատիական միության տարեկան գիտաժողովին: 2013 թ. մարտին Տեխասի Դիֆերենցիալ հավասարումների էլեկտրոնային ամսագրում տպագրվել է «Ռիսի բազիս՝ ծնված Շտուրմ-Լիուվիլլի խնդրի սպեկտրով» դասախոսիս հետ համատեղ գրված հոդվածս:
                <br /><br />
                Սակայն մաթեմատիկան իմ միակ հետքրքրությունը չէ: Շատ շնորհակալ եմ, որ հնարավարություն եմ ունեցել համագործակցելու «Այբ» և «Լույս» կրթական հիմնադրամների հետ: 2006 թ. մասնակցել եմ «Այբ» կրթական հիմնադրամի կողմից կազմակերպված «Առարկայական խորացված դասընթացներին» և հենց առաջին օրվանից հիացած եմ այնտեղ տիրող մթնոլորտով: Իսկ «Լույսի» մենթորության և պրակտիկայի ծրագրերն ինձ տվեցին տեսականից գործնականին սահուն անցումn զգալու, ինչպես նաև ծանոթություններիս ցանցն ընդլայնելու և աշխարհի լավագույն համալսարանների` տարբերր ոլորտներում կրթություն ստացող երիտասարդներից սովորելու հիանալի հնարավորություն:
                <br /><br />
                Ես համոզված եմ, որ Չիկագոյի համալսարանը կատարյալ վայր է մաթեմատիկայի հանդեպ ոգևորությունս ու սովորելու ցանկությունս խթանելու, հետազոտություններ անելու և նոր բաներ հայտնագործելու համար:</>,
            avatar: '/svg/8.jpg',
            start: 2012
        }
    ];

    useEffect(() => {
        if (router.query?.id) {
            const selectCard: any = cards.filter((el: any) => {
                return el.id == router.query?.id
            })

            setSelect(selectCard[0])
        }

    }, [router.query?.id])



    return (
        <MainLayout>
            <Timeline style={{ 'maxWidth': '1100px', 'margin': '0 auto' }}>
                <Timeline.Item color="green" dot={<UserOutlined />}>
                    <h2>{select?.header}</h2>
                    {/* <Card className='story-card' style={{ width: '100%', marginTop: 16 }}>
                        <Meta
                            avatar={}
                            title={select?.header}
                            description={<>
                                <br />
                                <TrophyTwoTone twoToneColor={'#ffd98e'} className='heartbeat' style={{ 'fontSize': '70px' }} />
                            </>}
                        />
                    </Card> */}
                    <Avatar src={select?.avatar} size={180} />
                </Timeline.Item>
                <Timeline.Item dot={<BookOutlined />}>
                    <h2>{select.desc}</h2>

                    <p>
                        {select?.text}
                    </p>
                </Timeline.Item>
                <Timeline.Item>
                    {/* <h3>ՏԵՍԱԴԱՐԱՆ</h3>
                    <Carousel autoplay>
                        <div>
                            <img src="/svg/p1.jpg" style={{ 'width': '100%', 'height': '400px', 'objectFit': 'contain' }} alt="UI" />
                        </div>
                        <div>
                            <img src="/svg/p2.jpg" style={{ 'width': '100%', 'height': '400px', 'objectFit': 'contain' }} alt="UI" />
                        </div>
                        <div>
                            <img src="/svg/p3.jpg" style={{ 'width': '100%', 'height': '400px', 'objectFit': 'contain' }} alt="UI" />
                        </div>
                    </Carousel> */}
                </Timeline.Item>
            </Timeline>
        </MainLayout>
    )
}

export default View
